# Multi-Condition Filtering in Pandas

In this notebook, you'll learn how to:
- Combine multiple filtering conditions  
- Use `.isin()` for category filtering  
- Filter text with `.str.contains()`  
- Handle missing (NaN) values during filtering

ðŸŸ¦ 1. Sample Dataset

In [1]:
import pandas as pd
import numpy as np

data = {
    "trip_id": [1, 2, 3, 4, 5, 6, 7],
    "route": ["10A", "20B", "10A", "30C", "20B", "10A", None],
    "delay_min": [2, 15, 5, 30, None, 8, 12],
    "driver_name": ["Ali", "Sara", "John", "Ali", "Sara", None, "Mike"]
}

df = pd.DataFrame(data)
df

   trip_id route  delay_min driver_name
0        1   10A        2.0         Ali
1        2   20B       15.0        Sara
2        3   10A        5.0        John
3        4   30C       30.0         Ali
4        5   20B        NaN        Sara
5        6   10A        8.0        None
6        7  None       12.0        Mike

ðŸŸ¦ 2. Combining Multiple Conditions

In [2]:
# Trips on route 10A with delay less than 10 minutes
df[(df["route"] == "10A") & (df["delay_min"] < 10)]

   trip_id route  delay_min driver_name
0        1   10A        2.0         Ali
2        3   10A        5.0        John
5        6   10A        8.0        None

In [3]:
df[(df["delay_min"] > 10) | (df["route"] == "30C")]

   trip_id route  delay_min driver_name
1        2   20B       15.0        Sara
3        4   30C       30.0         Ali
6        7  None       12.0        Mike

ðŸŸ¦ 3. Filtering with .isin()

In [4]:
# Select only selected routes
selected_routes = ["10A", "20B"]

df[df["route"].isin(selected_routes)]

   trip_id route  delay_min driver_name
0        1   10A        2.0         Ali
1        2   20B       15.0        Sara
2        3   10A        5.0        John
4        5   20B        NaN        Sara
5        6   10A        8.0        None

ðŸŸ¦ 4. Filtering with .str.contains()

Filter text columns using substring patterns.

In [5]:
# Routes containing "0"
df[df["route"].str.contains("0", na=False)]

   trip_id route  delay_min driver_name
0        1   10A        2.0         Ali
1        2   20B       15.0        Sara
2        3   10A        5.0        John
3        4   30C       30.0         Ali
4        5   20B        NaN        Sara
5        6   10A        8.0        None

In [7]:
# Case Insensitive Search
df[df["driver_name"].str.contains("ali", case=False, na=False)]

   trip_id route  delay_min driver_name
0        1   10A        2.0         Ali
3        4   30C       30.0         Ali

ðŸŸ¦ 5. Handling NaN Values During Filtering

5.1 Problematic Filtering

In [8]:
# This can break without na=False
df[df["route"].str.contains("A")]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

5.2 Safe Filtering with NaN Handling

In [9]:
df[df["route"].str.contains("A", na=False)]

   trip_id route  delay_min driver_name
0        1   10A        2.0         Ali
2        3   10A        5.0        John
5        6   10A        8.0        None

5.3 Detecting Missing Values

In [10]:
df[df["delay_min"].isna()]

   trip_id route  delay_min driver_name
4        5   20B        NaN        Sara

5.4 Filtering Non-NaN Rows

In [11]:
df[df["delay_min"].notna() & df["route"].notna()]

   trip_id route  delay_min driver_name
0        1   10A        2.0         Ali
1        2   20B       15.0        Sara
2        3   10A        5.0        John
3        4   30C       30.0         Ali
5        6   10A        8.0        None

5.5 Combine Filtering + NaN Handling

In [12]:
df[
    (df["delay_min"].notna()) &
    (df["delay_min"] > 5) &
    (df["route"].isin(["10A", "30C"]))
]

   trip_id route  delay_min driver_name
3        4   30C       30.0         Ali
5        6   10A        8.0        None

# Advanced Examples

ðŸŸ¦ 6. Using .query() for Cleaner Syntax

In [15]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "age": [22, 35, 40, 28, 19, np.nan],
    "salary": [50000, 80000, 120000, 65000, 30000, 70000],
    "city": ["Toronto", "Toronto", "Montreal", "Vancouver", "Toronto", "Montreal"],
    "department": ["IT", "HR", "IT", "Finance", "HR", "IT"]
})

df

      name   age  salary       city department
0    Alice  22.0   50000    Toronto         IT
1      Bob  35.0   80000    Toronto         HR
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance
4      Eva  19.0   30000    Toronto         HR
5    Frank   NaN   70000   Montreal         IT

In [16]:
df.query("age > 30")

      name   age  salary      city department
1      Bob  35.0   80000   Toronto         HR
2  Charlie  40.0  120000  Montreal         IT

In [17]:
df.query("age > 25 and salary < 100000")

    name   age  salary       city department
1    Bob  35.0   80000    Toronto         HR
3  David  28.0   65000  Vancouver    Finance

In [18]:
min_salary = 60000
df.query("salary >= @min_salary")

      name   age  salary       city department
1      Bob  35.0   80000    Toronto         HR
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance
5    Frank   NaN   70000   Montreal         IT

In [19]:
target_city = "Toronto"
df.query("city == @target_city")

    name   age  salary     city department
0  Alice  22.0   50000  Toronto         IT
1    Bob  35.0   80000  Toronto         HR
4    Eva  19.0   30000  Toronto         HR

In [20]:
df.query("city == 'Toronto' and salary > 40000")

    name   age  salary     city department
0  Alice  22.0   50000  Toronto         IT
1    Bob  35.0   80000  Toronto         HR

In [21]:
df.query("department == 'IT' or department == 'Finance'")

      name   age  salary       city department
0    Alice  22.0   50000    Toronto         IT
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance
5    Frank   NaN   70000   Montreal         IT

In [22]:
df.query("not city == 'Montreal'")

    name   age  salary       city department
0  Alice  22.0   50000    Toronto         IT
1    Bob  35.0   80000    Toronto         HR
3  David  28.0   65000  Vancouver    Finance
4    Eva  19.0   30000    Toronto         HR

In [23]:
df.query("city in ['Toronto', 'Vancouver']")

    name   age  salary       city department
0  Alice  22.0   50000    Toronto         IT
1    Bob  35.0   80000    Toronto         HR
3  David  28.0   65000  Vancouver    Finance
4    Eva  19.0   30000    Toronto         HR

In [24]:
cities = ["Montreal", "Toronto"]
df.query("city in @cities")

      name   age  salary      city department
0    Alice  22.0   50000   Toronto         IT
1      Bob  35.0   80000   Toronto         HR
2  Charlie  40.0  120000  Montreal         IT
4      Eva  19.0   30000   Toronto         HR
5    Frank   NaN   70000  Montreal         IT

In [25]:
df.query("name.str.contains('a')", engine="python")

      name   age  salary       city department
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance
4      Eva  19.0   30000    Toronto         HR
5    Frank   NaN   70000   Montreal         IT

In [26]:
df.query("name.str.startswith('A')", engine="python")

    name   age  salary     city department
0  Alice  22.0   50000  Toronto         IT

In [29]:
df.query("name.str.contains('A', case=False)", engine="python")

      name   age  salary       city department
0    Alice  22.0   50000    Toronto         IT
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance
4      Eva  19.0   30000    Toronto         HR
5    Frank   NaN   70000   Montreal         IT

In [30]:
df.query("age.notnull()", engine="python")

      name   age  salary       city department
0    Alice  22.0   50000    Toronto         IT
1      Bob  35.0   80000    Toronto         HR
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance
4      Eva  19.0   30000    Toronto         HR

In [31]:
df.query("25 <= age <= 40")

      name   age  salary       city department
1      Bob  35.0   80000    Toronto         HR
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance

In [32]:
condition = "age > 25 and salary > 60000 and city == 'Toronto'"
df.query(condition)

  name   age  salary     city department
1  Bob  35.0   80000  Toronto         HR

In [33]:
df.query("salary > age * 2000")

      name   age  salary       city department
0    Alice  22.0   50000    Toronto         IT
1      Bob  35.0   80000    Toronto         HR
2  Charlie  40.0  120000   Montreal         IT
3    David  28.0   65000  Vancouver    Finance

In [38]:
df.query(
    "department == 'IT' "
    "and city == 'Toronto' "
    "and salary > 40000 "
    "and age.notnull()",
    engine="python"
)

    name   age  salary     city department
0  Alice  22.0   50000  Toronto         IT